#!/usr/bin/env python 
# -*- coding: utf-8 -*-
# @Time    : 2021/8/12 21:36
# @Author  : hanyou
# @Software: PyCharm

from clock import *

if __name__ == '__main__':
    timedict = {'08:00:00': '早餐', '08:30:00': '口语', '09:00:00': '数学', '11:30:00': '午饭', '12:00:00': '单词',
                '12:30:00': '午觉', '13:30:00': '英语', '16:00:00': '力扣', '17:00:00': '公考与国策', '18:00:00': '晚饭',
                '18:30:00': '休息', '19:00:00': '健身', '20:30:00': '洗澡', '21:00:00': '钢琴', '22:00:00': '阅读',
                '22:30:00': '回复消息', '23:00:00': '睡觉'}

    creat_window(timedict)

